DataProcessors/ФормированиеЗаказаПоставщикуНаОсновеМатрицы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеЗаказаПоставщикуНаОсновеМатрицы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыПровести</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>мТекущаяНастройка</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПостроителя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоОсновномуПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаТоваров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПроизводителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвободныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаПриемке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеЗаказано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГорючиеЖидкости</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Секция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АВС_Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АВСКлассификацияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокВМоскве</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДопПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикТОХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставщикиТОХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВТОХПоставщика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БрендыОтборВключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БрендыОтборИсключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатурныеГруппыОтборВключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатурныеГруппыОтборИсключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СозданиеЗаказовГруппыИСекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаАВСФилиала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АВСКлассификацияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Секция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СозданиеЗаказовНастройкиСекций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Секция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтрокВЗаказе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентОкругления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЧЗОтборВключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаЧЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЧЗОтборИсключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаЧЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/МатрицаДляПополнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МатрицаДляПополнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ФормированиеЗаказаПоставщикуНаОсновеМатрицы/Ext/ObjectModule.bsl
Процедура ИнициироватьПостроительДляОтбора(ПостроительОтчета) Экспорт
	
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(Товары.Выгрузить());
	ПостроительОтчета.ЗаполнитьНастройки();
	СтруктураПредставлениеПолей = Новый Структура;
	
КонецПроцедуры

Процедура ВосстановитьНастройкиРегламентаИзСтруктуры(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Свойство("КолСтрок"					      , КолСтрок);
	СохраненнаяНастройка.Свойство("ДокументыПровести"				  , ДокументыПровести);
	//СохраненнаяНастройка.Свойство("ПоОсновномуПоставщику"			  , ПоОсновномуПоставщику);
	
	ВрБрендыОтборВключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("БрендыОтборВключить"		  , ВрБрендыОтборВключить) Тогда
		БрендыОтборВключить.Загрузить(ВрБрендыОтборВключить);
	КонецЕсли;
	
	ВрБрендыОтборИсключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("БрендыОтборИсключить"		  , ВрБрендыОтборИсключить) Тогда
		БрендыОтборИсключить.Загрузить(ВрБрендыОтборИсключить);
	КонецЕсли;
	
	ВрНоменклатурныеГруппыОтборВключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("НоменклатурныеГруппыОтборВключить" , ВрНоменклатурныеГруппыОтборВключить) Тогда
		НоменклатурныеГруппыОтборВключить.Загрузить(ВрНоменклатурныеГруппыОтборВключить);
	КонецЕсли;
	
	ВрНоменклатурныеГруппыОтборИсключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("НоменклатурныеГруппыОтборИсключить"		  , ВрНоменклатурныеГруппыОтборИсключить) Тогда
		НоменклатурныеГруппыОтборИсключить.Загрузить(ВрНоменклатурныеГруппыОтборИсключить);
	КонецЕсли;
	
	ВрПостроительОтчета = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("НастройкаПостроителя"		          , ВрПостроительОтчета) Тогда	
		
		НастройкаПостроителя = ВрПостроительОтчета;
		ИнициироватьПостроительДляОтбора(ПостроительОтчета);
		ПостроительОтчета.УстановитьНастройки(НастройкаПостроителя);
		
	КонецЕсли;
	
	СохраненнаяНастройка.Свойство("ДатаДокумента"					          , ДатаДокумента); 
	
	ВрСозданиеЗаказовГруппыИСекции = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("СозданиеЗаказовГруппыИСекции"		  , ВрСозданиеЗаказовГруппыИСекции) Тогда
		СозданиеЗаказовГруппыИСекции.Загрузить(ВрСозданиеЗаказовГруппыИСекции);
	КонецЕсли;
	
	ВрСозданиеЗаказовНастройкиСекций = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("СозданиеЗаказовНастройкиСекций"		  , ВрСозданиеЗаказовНастройкиСекций) Тогда
		СозданиеЗаказовНастройкиСекций.Загрузить(ВрСозданиеЗаказовНастройкиСекций);
	КонецЕсли;
	
	//+Сёмин Р.И. 30.07.2026 #UT10-5981
	ВрГруппыЧЗОтборВключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("ГруппыЧЗОтборВключить", ВрГруппыЧЗОтборВключить) Тогда
		ГруппыЧЗОтборВключить.Загрузить(ВрГруппыЧЗОтборВключить);
	КонецЕсли;
	
	ВрГруппыЧЗОтборИсключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("ГруппыЧЗОтборИсключить", ВрГруппыЧЗОтборИсключить) Тогда
		ГруппыЧЗОтборИсключить.Загрузить(ВрГруппыЧЗОтборИсключить);
	КонецЕсли;
	//-Сёмин Р.И. 30.07.2026 #UT10-5981
	
КонецПроцедуры

Процедура СохранитьНастройкиРегламентаВСтруктуру(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Вставить("КолСтрок"   					      , КолСтрок);
	СохраненнаяНастройка.Вставить("ДокументыПровести"				  , ДокументыПровести);
	СохраненнаяНастройка.Вставить("БрендыОтборВключить"			      , БрендыОтборВключить.Выгрузить());
	СохраненнаяНастройка.Вставить("БрендыОтборИсключить"		      , БрендыОтборИсключить.Выгрузить());
	СохраненнаяНастройка.Вставить("НоменклатурныеГруппыОтборВключить" , НоменклатурныеГруппыОтборВключить.Выгрузить());
	СохраненнаяНастройка.Вставить("НоменклатурныеГруппыОтборИсключить", НоменклатурныеГруппыОтборИсключить.Выгрузить());
	СохраненнаяНастройка.Вставить("НастройкаПостроителя"			  , ПостроительОтчета.ПолучитьНастройки());
	СохраненнаяНастройка.Вставить("ДатаДокумента"					  , ДатаДокумента);
	СохраненнаяНастройка.Вставить("СозданиеЗаказовНастройкиСекций"    , СозданиеЗаказовНастройкиСекций.Выгрузить());
	СохраненнаяНастройка.Вставить("СозданиеЗаказовГруппыИСекции"      , СозданиеЗаказовГруппыИСекции.Выгрузить()); 
	// СохраненнаяНастройка.Вставить("ПоОсновномуПоставщику"   		  , ПоОсновномуПоставщику);
	
	//+Сёмин Р.И. 30.07.2026 #UT10-5981
	СохраненнаяНастройка.Вставить("ГруппыЧЗОтборВключить"			  , ГруппыЧЗОтборВключить.Выгрузить());
	СохраненнаяНастройка.Вставить("ГруппыЧЗОтборИсключить"			  , ГруппыЧЗОтборИсключить.Выгрузить());
	//-Сёмин Р.И. 30.07.2026 #UT10-5981
	
КонецПроцедуры

Процедура ВыполнитьЗапрос(ЭтоРегламент = Ложь) Экспорт
	
	Товары.Очистить(); 
	
	Запрос = Новый Запрос; 
	
	ТекстЗапросаОграничениеПоНоменклатуре = "";
	
	Если БрендыОтборВключить.Количество()> 0 Тогда
		
		МассивБрендов = БрендыОтборВключить.ВыгрузитьКолонку("Бренд");
		Запрос.УстановитьПараметр("МассивБрендов", МассивБрендов);
		
		ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
		+ " И МатрицаДляПополнения.Номенклатура.Родитель В (&МассивБрендов) ";
		
	КонецЕсли;
	
	Если НоменклатурныеГруппыОтборВключить.Количество()> 0 Тогда
		
		МассивНГ = НоменклатурныеГруппыОтборВключить.ВыгрузитьКолонку("НоменклатурнаяГруппа");
		Запрос.УстановитьПараметр("МассивНГ", МассивНГ);
		
		ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
		+" И МатрицаДляПополнения.Номенклатура.НоменклатурнаяГруппа В (&МассивНГ) ";
		
	КонецЕсли;
	
	
	Если БрендыОтборИсключить.Количество()> 0 Тогда
		
		МассивБрендовИсключить = БрендыОтборИсключить.ВыгрузитьКолонку("Бренд");
		Запрос.УстановитьПараметр("МассивБрендовИсключить", МассивБрендовИсключить);
		
		ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
		+" И МатрицаДляПополнения.Номенклатура.Родитель НЕ В (&МассивБрендовИсключить) ";
		
	КонецЕсли;
	
	Если НоменклатурныеГруппыОтборИсключить.Количество()> 0 Тогда
		
		МассивНГИсключить = НоменклатурныеГруппыОтборИсключить.ВыгрузитьКолонку("НоменклатурнаяГруппа");
		Запрос.УстановитьПараметр("МассивНГИсключить", МассивНГИсключить);
		
		ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
		+" И МатрицаДляПополнения.Номенклатура.НоменклатурнаяГруппа НЕ В (&МассивНГИсключить) ";
		
	КонецЕсли;
	
	//+Сёмин Р.И. 30.07.2026 #UT10-5981
	Если ГруппыЧЗОтборВключить.Количество() > 0 Тогда
		
		МассивГруппЧЗ = ГруппыЧЗОтборВключить.ВыгрузитьКолонку("ГруппаЧЗ");
		Запрос.УстановитьПараметр("МассивГруппЧЗ", МассивГруппЧЗ);
		
		ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
		+" И МатрицаДляПополнения.Номенклатура.ТоварнаяГруппаЧестногоЗнака В (&МассивГруппЧЗ) ";
		
	КонецЕсли;
	
	Если ГруппыЧЗОтборИсключить.Количество() > 0 Тогда
		
		МассивГруппЧЗИсключить = ГруппыЧЗОтборИсключить.ВыгрузитьКолонку("ГруппаЧЗ");
		Запрос.УстановитьПараметр("МассивГруппЧЗИсключить", МассивГруппЧЗИсключить);
		
		ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
		+" И МатрицаДляПополнения.Номенклатура.ТоварнаяГруппаЧестногоЗнака НЕ В (&МассивГруппЧЗИсключить) ";
		
	КонецЕсли;
	//-Сёмин Р.И. 30.07.2026 #UT10-5981
	
	//	|   %%ДопПараметрыОтбора%%  
	//+Гавриленков В. 06.08.2025 #UT10-5372 В таблице вывода изменил Внутреннее соединение на Левое соединение (с регистром Московские остатки номенклатуры)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Константы.ОсновнойСклад КАК Склад
	|ПОМЕСТИТЬ ВТ_ОсновнойСклад
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаДляПополнения.Номенклатура,
	|	МатрицаДляПополнения.МинимальноеКоличество,
	|	МатрицаДляПополнения.МаксимальноеКоличество
	|ПОМЕСТИТЬ ВТ_МатрицаТоваров
	|ИЗ
	|	РегистрСведений.МатрицаДляПополнения КАК МатрицаДляПополнения
	|ГДЕ
	|	МатрицаДляПополнения.МинимальноеКоличество > 0
	|	И МатрицаДляПополнения.МаксимальноеКоличество > 0
	|   %%ДопПараметрыОтбора%%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МатрицаТоваров.Номенклатура,
	|	МИНИМУМ(ВТ_МатрицаТоваров.МинимальноеКоличество) КАК МинимальноеКоличество,
	|	МАКСИМУМ(ВТ_МатрицаТоваров.МаксимальноеКоличество) КАК МаксимальноеКоличество,
	|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) КАК ЗаказаноПоставщику,
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)) КАК ОстатокВЯчейках,
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстаткиНедоступные.КоличествоОстаток, 0)) КАК ОстатокВЯчейкахНедоступные,
	|	СУММА(ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)) КАК ОстатокСобрано,
	|	СУММА(ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) КАК ОстатокКСборке,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК ОстатокНаСкладе,
	|	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК ОстатоквРезерве
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	ВТ_МатрицаТоваров КАК ВТ_МатрицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_МатрицаТоваров.Номенклатура
	|					ИЗ
	|						ВТ_МатрицаТоваров)) КАК ЗаказыПоставщикамОстатки
	|		ПО ВТ_МатрицаТоваров.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				НЕ Ячейка.НеУчитыватьВОперативномУчете
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_МатрицаТоваров.Номенклатура
	|						ИЗ
	|							ВТ_МатрицаТоваров)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВТ_МатрицаТоваров.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_МатрицаТоваров.Номенклатура
	|					ИЗ
	|						ВТ_МатрицаТоваров)) КАК ТоварыВСборкеОстатки
	|		ПО ВТ_МатрицаТоваров.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				Склад В
	|						(ВЫБРАТЬ
	|							ВТ_ОсновнойСклад.Склад
	|						ИЗ
	|							ВТ_ОсновнойСклад)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_МатрицаТоваров.Номенклатура
	|						ИЗ
	|							ВТ_МатрицаТоваров)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_МатрицаТоваров.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Склад В
	|						(ВЫБРАТЬ
	|							ВТ_ОсновнойСклад.Склад
	|						ИЗ
	|							ВТ_ОсновнойСклад)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_МатрицаТоваров.Номенклатура
	|						ИЗ
	|							ВТ_МатрицаТоваров)) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ВТ_МатрицаТоваров.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка.НеУчитыватьВОперативномУчете
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_МатрицаТоваров.Номенклатура
	|						ИЗ
	|							ВТ_МатрицаТоваров)) КАК ТоварыВЯчейкахОстаткиНедоступные
	|		ПО ВТ_МатрицаТоваров.Номенклатура = ТоварыВЯчейкахОстаткиНедоступные.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МатрицаТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_Остатки.Номенклатура.Кратность = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВТ_Остатки.Номенклатура.Кратность
	|	КОНЕЦ КАК Кратность,
	|	ВТ_Остатки.МинимальноеКоличество,
	|	ВТ_Остатки.МаксимальноеКоличество,
	|	ВТ_Остатки.ЗаказаноПоставщику КАК УжеЗаказано,
	|	ВТ_Остатки.ОстатокВЯчейках + ВТ_Остатки.ОстатокСобрано + ВТ_Остатки.ОстатокКСборке - ВТ_Остатки.ОстатоквРезерве КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Остатки.ОстатокНаСкладе - ВТ_Остатки.ОстатокВЯчейках - ВТ_Остатки.ОстатокВЯчейкахНедоступные + ВТ_Остатки.ОстатокСобрано + ВТ_Остатки.ОстатокКСборке - ВТ_Остатки.ОстатоквРезерве - ВТ_Остатки.ОстатоквРезерве < 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Остатки.ОстатокНаСкладе - ВТ_Остатки.ОстатокВЯчейках - ВТ_Остатки.ОстатокВЯчейкахНедоступные + ВТ_Остатки.ОстатокСобрано + ВТ_Остатки.ОстатокКСборке - ВТ_Остатки.ОстатоквРезерве - ВТ_Остатки.ОстатоквРезерве
	|	КОНЕЦ КАК КоличествоНаПриемке
	|ПОМЕСТИТЬ ВТ_КЗаказу
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КЗаказу.Номенклатура,
	|	ВТ_КЗаказу.Кратность,
	|	ВТ_КЗаказу.МинимальноеКоличество,
	|	ВТ_КЗаказу.МаксимальноеКоличество,
	|	ВТ_КЗаказу.УжеЗаказано,
	|	ВТ_КЗаказу.СвободныйОстаток,
	|	ВТ_КЗаказу.КоличествоНаПриемке КАК КоличествоНаПриемке,
	|	ВЫБОР
	|		КОГДА ВТ_КЗаказу.МинимальноеКоличество - ВТ_КЗаказу.СвободныйОстаток - ВТ_КЗаказу.УжеЗаказано - ВТ_КЗаказу.КоличествоНаПриемке < 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_КЗаказу.МинимальноеКоличество - ВТ_КЗаказу.СвободныйОстаток - ВТ_КЗаказу.УжеЗаказано - ВТ_КЗаказу.КоличествоНаПриемке
	|	КОНЕЦ > 0 КАК НадоЗаказать,
	|	ВТ_КЗаказу.МаксимальноеКоличество - ВТ_КЗаказу.СвободныйОстаток - ВТ_КЗаказу.УжеЗаказано - ВТ_КЗаказу.КоличествоНаПриемке КАК ВЗаказ,
	|	ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.Количество, 0) КАК ОстатокВМоскве,
	|	ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщика, 0) КАК ОстатокДопПоставщика
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_КЗаказу КАК ВТ_КЗаказу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МосковскиеОстаткиНоменклатуры КАК МосковскиеОстаткиНоменклатуры
	|		ПО ВТ_КЗаказу.Номенклатура = МосковскиеОстаткиНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоставщикиТОХПроизводителиПоУмолчанию.Ссылка КАК Поставщик,
	|	ПоставщикиТОХПроизводителиПоУмолчанию.ПроизводительПоУмолчанию КАК Производитель
	|ПОМЕСТИТЬ ВТ_ПостащикиТОХ
	|ИЗ
	|	Справочник.ПоставщикиТОХ.ПроизводителиПоУмолчанию КАК ПоставщикиТОХПроизводителиПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура,
	|	ВТ_Итог.Номенклатура.Артикул КАК Артикул,
	|	ВТ_Итог.Кратность КАК Кратность,
	|	ВТ_Итог.Номенклатура.Родитель КАК ГруппаТоваров,
	|	ВТ_Итог.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ВТ_Итог.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_Итог.СвободныйОстаток,
	|	ВТ_Итог.УжеЗаказано,
	|	ВТ_Итог.КоличествоНаПриемке,
	|	ВТ_Итог.МинимальноеКоличество КАК МинОстаток,
	|	ВТ_Итог.МаксимальноеКоличество КАК МаксОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Итог.НадоЗаказать
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Итог.Кратность = 1
	|						ТОГДА ВТ_Итог.ВЗаказ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЦЕЛ(ВТ_Итог.ВЗаказ / ВТ_Итог.Кратность) = ВТ_Итог.ВЗаказ / ВТ_Итог.Кратность
	|								ТОГДА ВТ_Итог.ВЗаказ
	|							ИНАЧЕ (ЦЕЛ(ВТ_Итог.ВЗаказ / ВТ_Итог.Кратность) + 1) * ВТ_Итог.Кратность
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВЗаказ,
	|	ВТ_Итог.Номенклатура.ГорючиеЖидкости КАК ГорючиеЖидкости,
	|	ВЫБОР
	|		КОГДА ВТ_Итог.Номенклатура.ГруппаАВСФилиала = ЗНАЧЕНИЕ(Справочник.АВСКлассификацияНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.АВСКлассификацияНоменклатуры.E_филиал)
	|		ИНАЧЕ ВТ_Итог.Номенклатура.ГруппаАВСФилиала
	|	КОНЕЦ КАК АВС_Филиал,
	|	ВТ_Итог.ОстатокВМоскве,
	|	ВТ_Итог.ОстатокДопПоставщика,
	|	ВЫБОР
	|		КОГДА &ПоДопПостащику
	|			ТОГДА ЕСТЬNULL(ВТ_ПостащикиТОХ.Поставщик, ЗНАЧЕНИЕ(Справочник.ПоставщикиТОХ.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПоставщикиТОХ.ПустаяСсылка)
	|	КОНЕЦ КАК ПоставщикТОХ
	|ПОМЕСТИТЬ ВТ_Вывод
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПостащикиТОХ КАК ВТ_ПостащикиТОХ
	|		ПО ВТ_Итог.Номенклатура.Родитель = ВТ_ПостащикиТОХ.Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вывод.Номенклатура,
	|	ВТ_Вывод.Артикул,
	|	ВТ_Вывод.Кратность,
	|	ВТ_Вывод.ГруппаТоваров,
	|	ВТ_Вывод.КодПроизводителя,
	|	ВТ_Вывод.НоменклатурнаяГруппа,
	|	ВТ_Вывод.СвободныйОстаток,
	|	ВТ_Вывод.УжеЗаказано,
	|	ВТ_Вывод.КоличествоНаПриемке,
	|	ВТ_Вывод.МинОстаток,
	|	ВТ_Вывод.МаксОстаток,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_Вывод.ПоставщикТОХ = ЗНАЧЕНИЕ(Справочник.ПоставщикиТОХ.ПустаяСсылка)
	|				И ВТ_Вывод.ПоставщикТОХ.РазделятьВыкупы
	|				И &ИсключатьПостащиковСРазделениемВыкупа
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Вывод.ВЗаказ
	|	КОНЕЦ КАК ВЗаказ,
	|	ВТ_Вывод.ГорючиеЖидкости,
	|	ВТ_Вывод.АВС_Филиал,
	|	ВТ_Вывод.ОстатокВМоскве,
	|	ВТ_Вывод.ОстатокДопПоставщика,
	|	ВТ_Вывод.ПоставщикТОХ КАК ПоставщикТОХ,
	|	ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщикаТОХ, 0) КАК КоличествоДопПоставщикаТОХ,
	|	ЛОЖЬ КАК ЕстьВТОХПоставщика
	|ИЗ
	|	ВТ_Вывод КАК ВТ_Вывод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МосковскиеОстаткиНоменклатуры КАК МосковскиеОстаткиНоменклатуры
	|		ПО ВТ_Вывод.Номенклатура = МосковскиеОстаткиНоменклатуры.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоставщикТОХ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%%ДопПараметрыОтбора%%",ТекстЗапросаОграничениеПоНоменклатуре);
	
	//+Кабанов А.В. 02.06.2025 # UT10-5262
	Запрос.УстановитьПараметр("ПоДопПостащику" , НЕ ПоОсновномуПоставщику);
	
	КодГрузополучателяПополнение = Константы.КодКонтрагентаВстороннейУТ10Пополнение.Получить();
	мНеОбъединятьВОбщемВыкупе = Истина;
	
	Если ЗначениеЗаполнено(КодГрузополучателяПополнение) Тогда
		ГрузополучательПополнение = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ",КодГрузополучателяПополнение);
		мНеОбъединятьВОбщемВыкупе = ГрузополучательПополнение.НеОбъединятьВОбщемВыкупе;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИсключатьПостащиковСРазделениемВыкупа" , НЕ ПоОсновномуПоставщику И ЭтоРегламент И мНеОбъединятьВОбщемВыкупе);
	//-Кабанов А.В. 02.06.2025 # UT10-5262
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();       
	
	//+Белов А. 21.07.2025 #UT10-5341
	Если НЕ ПоОсновномуПоставщику Тогда
		
		Для каждого Стр Из РезультатЗапроса Цикл
			
			Если Стр.КоличествоДопПоставщикаТОХ > 0 Тогда
				
				Если Стр.ВЗаказ <= Стр.КоличествоДопПоставщикаТОХ Тогда
					Стр.ЕстьВТОХПоставщика = Истина;
				Иначе
					
					Остаток = Стр.ВЗаказ - Стр.КоличествоДопПоставщикаТОХ;
					Стр.ВЗаказ = Стр.КоличествоДопПоставщикаТОХ;
					Стр.ЕстьВТОХПоставщика = Истина;
					
					НСтр = РезультатЗапроса.Добавить();
					ЗаполнитьЗначенияСвойств(НСтр, Стр);   
					НСтр.ВЗаказ = Остаток; 
					НСтр.КоличествоДопПоставщикаТОХ = 0;
					НСтр.ЕстьВТОХПоставщика = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЦикла;
		
	КонецЕсли;
	//-Белов А. 21.07.2025 #UT10-5341
	
	Товары.Загрузить(РезультатЗапроса);
	
	РезультатПримененияОтбора = ОбработатьТаблицу();
	
	СтрокиБезНоменклатуры = РезультатПримененияОтбора.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка()));
	
	Для Каждого СтрокаБезНоменклатуры Из СтрокиБезНоменклатуры Цикл
		РезультатПримененияОтбора.Удалить(СтрокаБезНоменклатуры);
	КонецЦикла;
	
	Товары.Загрузить(РезультатПримененияОтбора);
	
КонецПроцедуры

Функция ОбработатьТаблицу()
	
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(Товары.Выгрузить());
	
	ПостроительОтчета.Выполнить();
	Рез = ПостроительОтчета.Результат;
	Таб	= Рез.Выгрузить();
	
	Возврат Таб
	
КонецФункции

Процедура ЗаполнитьСекциюВТаблицеМодуль() Экспорт
	
	ПромТовары = Товары.Выгрузить();
	
	Если СозданиеЗаказовГруппыИСекции.Количество() > 0 И СозданиеЗаказовНастройкиСекций.Количество() > 0  Тогда
		
		Для Каждого СтрокаТовары Из ПромТовары Цикл
			
			Если СтрокаТовары.ГорючиеЖидкости Тогда 
				СтрокаТовары.Секция = "Def";
			Иначе
				
				ЕстьНастройкаДляГруппыАВС = СозданиеЗаказовГруппыИСекции.Найти(СтрокаТовары.АВС_Филиал, "ГруппаАВСФилиала");
				
				Если НЕ ЕстьНастройкаДляГруппыАВС = Неопределено Тогда
					СтрокаТовары.Секция = ЕстьНастройкаДляГруппыАВС.Секция;
				Иначе
					СтрокаТовары.Секция = "Def"; 
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ПромТовары.ЗаполнитьЗначения("Def", "Секция");		
	КонецЕсли;	
	
	Товары.Загрузить(ПромТовары);
	
КонецПроцедуры  
  
Функция ПолучитьДоговорКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 1 Тогда 
		
		ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора("ФормаВыбора", ,);
		ФормаВыбора.Отбор.Владелец.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.Владелец.Значение = Контрагент;
		ФормаВыбора.Отбор.Владелец.Использование = Истина;
		
		ФормаВыбора.Отбор.ВидДоговора.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ВидДоговора.Значение = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ФормаВыбора.Отбор.ВидДоговора.Использование = Истина;
		
		Результат = ФормаВыбора.ОткрытьМодально();
		
		Если Результат = Неопределено Тогда
			Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();	
		КонецЕсли; 		
		
	ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
		
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.Ссылка;
		
	КонецЕсли; 
	
	Возврат Результат;	  
	
КонецФункции
  
Процедура СоздатьДокументыМодуль(мНегабарит = Неопределено, МассивНовыхДокументов, ЭтоРегламент = Ложь, ЗаказНаГорючиеЖидкости = Ложь , ПоставщикТОХ = Неопределено, ЕстьВТОХПоставщика = Ложь, МассивДляОбъединения = Неопределено) Экспорт
	
	ЗаполнитьСекциюВТаблицеМодуль();  
	
	//+Кабанов А.В. 02.06.2025 # UT10-5262
	КодГрузополучателяПополнение = Константы.КодКонтрагентаВстороннейУТ10Пополнение.Получить();
	мНеОбъединятьВОбщемВыкупе = Истина;
	
	Если ЗначениеЗаполнено(КодГрузополучателяПополнение) Тогда
		ГрузополучательПополнение = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ",КодГрузополучателяПополнение);
		мНеОбъединятьВОбщемВыкупе = ГрузополучательПополнение.НеОбъединятьВОбщемВыкупе;
	КонецЕсли;	  
	//-Кабанов А.В. 02.06.2025 # UT10-5262
	
	Если КолСтрок = 0 Тогда 
		КолСтрок = 200;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.ВЗаказ > 0 
	| И ТаблицаТовары.ПоставщикТОХ = &ПоставщикТОХ
	//+Белов А. 21.07.2025 #UT10-5341             
	| И ТаблицаТовары.ЕстьВТОХПоставщика = &ЕстьВТОХПоставщика";	  
	
	Запрос.УстановитьПараметр("ЕстьВТОХПоставщика", ЕстьВТОХПоставщика); 
	
	//+Гавриленков В. 31.07.2025 #UT10-5366
	ЭтоРазделениеПоТОХ = (?(ПоставщикТОХ = Неопределено, Справочники.ПоставщикиТОХ.ПустаяСсылка(), ПоставщикТОХ) <> Справочники.ПоставщикиТОХ.ПустаяСсылка()) И ЕстьВТОХПоставщика = Ложь;
	//ЭтоРазделениеПоТОХ = ПоставщикТОХ <> Неопределено И ЕстьВТОХПоставщика = Ложь;
	//-Белов А. 21.07.2025 #UT10-5341 
	//-Гавриленков В. 31.07.2025 #UT10-5366
	
	//+Кабанов А.В. 02.06.2025 # UT10-5262
	Запрос.УстановитьПараметр("ПоставщикТОХ",	?(ПоставщикТОХ = Неопределено , Справочники.ПоставщикиТОХ.ПустаяСсылка() , ПоставщикТОХ));
	//-Кабанов А.В. 02.06.2025 # UT10-5262
	
	Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() И НЕ ЗаказНаГорючиеЖидкости Тогда
		
		Запрос.Текст = Запрос.Текст +
		"  И НЕ ТаблицаТовары.ГорючиеЖидкости "; 
		
	ИначеЕсли Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() И ЗаказНаГорючиеЖидкости Тогда
		
		Запрос.Текст = Запрос.Текст +
		"  И ТаблицаТовары.ГорючиеЖидкости ";
		
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст + "	
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары";
	
	Запрос.УстановитьПараметр("ТаблицаТовары",	Товары.Выгрузить());
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		//+Белов А. 21.07.2025 #UT10-5341
		Если НЕ ЭтоРазделениеПоТОХ Тогда
			
			#Если Клиент Тогда
				Предупреждение("Нет строк для переноса в документ!", 10);
			#КонецЕсли
			
		КонецЕсли; 
		//-Белов А. 21.07.2025 #UT10-5341
		
		Возврат;
		
	Иначе	
		
		ПромТаблСекций 								   = СозданиеЗаказовНастройкиСекций.Выгрузить();
		НоваяСтрокаПромТаблСекций						   = ПромТаблСекций.Добавить();
		НоваяСтрокаПромТаблСекций.Секция				   = "Def";
		НоваяСтрокаПромТаблСекций.КоличествоСтрокВЗаказе = КолСтрок;
		НоваяСтрокаПромТаблСекций.КоэффициентОкругления  = 0.5;
		
		ВыборкаЗапроса = Результат.Выгрузить();
		Склад = Константы.ОсновнойСклад.Получить();
		
		ДатаДокумента = ?(ДатаДокумента = Дата(1, 1, 1) ИЛИ ЭтоРегламент , ТекущаяДата(), ДатаДокумента);
		
		Если ПоОсновномуПоставщику Тогда 
			Контрагент = Константы.ОсновнойПоставщик.Получить();		  
		Иначе   
			
			Если ЗначениеЗаполнено(Поставщик) И НЕ ЭтоРегламент Тогда
				
				Контрагент = Поставщик;				  
				ВыборкаЗапроса.ЗаполнитьЗначения("Def","Секция");
				
			Иначе
				Контрагент = Константы.ДопПоставщик.Получить();  
			КонецЕсли;
			
		КонецЕсли;
		
		ДоговорКонтагента = Контрагент.ОсновнойДоговорКонтрагента;		
		
		Если ДоговорКонтагента.Пустая() ИЛИ НЕ ДоговорКонтагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			ДоговорКонтагента = ПолучитьДоговорКонтрагента(Контрагент);
		КонецЕсли;
		
		Если ДоговорКонтагента.Пустая() Или НЕ ДоговорКонтагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			
			#Если Клиент Тогда
				Сообщить("Договор вида ""С Поставщиком"" у контрагента " + """" + Контрагент + """ отсутствует или не выбран.", СтатусСообщения.ОченьВажное);			
			#КонецЕсли
			
			Возврат;
			
		КонецЕсли; 
		
		
		Для Каждого СтрокаТаблСекций Из ПромТаблСекций Цикл
			
			СтрокВДокументе 	= 0; 
			ТекТовар 			= 0;
			
			ВыборкаПоСекции = ВыборкаЗапроса.НайтиСтроки(Новый Структура("Секция", СтрокаТаблСекций.Секция));
			
			КоличествоТоваровВВыборке = ВыборкаПоСекции.Количество();
			КолСтрокДляСекции		  = СтрокаТаблСекций.КоличествоСтрокВЗаказе;
			ПромКолСтрокДляСекции	  = КоличествоТоваровВВыборке / ?(СтрокаТаблСекций.КоличествоСтрокВЗаказе = 0, КолСтрок, СтрокаТаблСекций.КоличествоСтрокВЗаказе);  		
			ДробнаяЧастьКолСтрок  	  = ПромКолСтрокДляСекции - Цел(ПромКолСтрокДляСекции);
			
			Если ДробнаяЧастьКолСтрок < СтрокаТаблСекций.КоэффициентОкругления Тогда
				КолСтрокДляСекции = Окр(КоличествоТоваровВВыборке / ?(Цел(ПромКолСтрокДляСекции) = 0, 1, Цел(ПромКолСтрокДляСекции)), 0, РежимОкругления.Окр15как20); 
			Иначе
				КолСтрокДляСекции = Окр(КоличествоТоваровВВыборке / Окр(ПромКолСтрокДляСекции, 0, РежимОкругления.Окр15как20), 0, РежимОкругления.Окр15как20);
			КонецЕсли;
			
			НовыйДокумент = Документы.ЗаказПоставщику.СоздатьДокумент();
			
			Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() И ЗаказНаГорючиеЖидкости Тогда
				НовыйДокумент.ГорючиеЖидкости = Истина;
			КонецЕсли;		
			
			Если НЕ НовыйДокумент.ГорючиеЖидкости И НЕ СтрокаТаблСекций.Секция = "Def" Тогда
				НовыйДокумент.Секция = СтрокаТаблСекций.Секция; 					
			КонецЕсли;	
			
			
			//+Кабанов А.В. 02.06.2025 # UT10-5262
			Если НЕ ПоставщикТОХ = Неопределено Тогда
				
				//+Белов А. 21.07.2025 #UT10-5341
				Если ЕстьВТОХПоставщика Тогда
					НовыйДокумент.ДоговорПоставщикаТОХ = ПоставщикТОХ.ДоговорКонтрагента;
				КонецЕсли;
				//-Белов А. 21.07.2025 #UT10-5341
				
			КонецЕсли;
			//-Кабанов А.В. 02.06.2025 # UT10-5262
			
			Для Каждого Выборка Из ВыборкаПоСекции Цикл 
				
				ТекТовар 		  = ТекТовар + 1;
				СтрокВДокументе = СтрокВДокументе + 1;
				
				НоваяСтрокаТЧ 				 = НовыйДокумент.Товары.Добавить();
				НоваяСтрокаТЧ.Номенклатура 	 = Выборка.Номенклатура;
				НоваяСтрокаТЧ.ЕдиницаИзмерения = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТЧ.Количество 		 = Выборка.ВЗаказ;
				НоваяСтрокаТЧ.Коэффициент 	 = НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент; 
				
				//+Гавриленков В. 18.12.2025 #UT10-5598
				//НоваяСтрокаТЧ.СтавкаНДС 	     = НоваяСтрокаТЧ.Номенклатура.СтавкаНДС; 
				НоваяСтрокаТЧ.СтавкаНДС 	     = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НоваяСтрокаТЧ.Номенклатура, ?(ЭтоРегламент, ТекущаяДата(), ДатаДокумента));
				//-Гавриленков В. 18.12.2025 #UT10-5598
				
				СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(НоваяСтрокаТЧ.СтавкаНДС);			
				
				Если СтрокВДокументе = КолСтрокДляСекции ИЛИ ТекТовар = КоличествоТоваровВВыборке Тогда 
					
					НовыйДокумент.Дата 					= ?(ЭтоРегламент, ТекущаяДата(), ДатаДокумента);
					НовыйДокумент.Контрагент  			= Контрагент;
					НовыйДокумент.ДоговорКонтрагента 	    = ДоговорКонтагента; 
					НовыйДокумент.ВалютаДокумента 		= ДоговорКонтагента.ВалютаВзаиморасчетов;
					НовыйДокумент.КурсВзаиморасчетов 	    = 1;
					НовыйДокумент.КратностьВзаиморасчетов = 1;
					НовыйДокумент.Организация 			= ДоговорКонтагента.Организация;
					НовыйДокумент.СуммаВключаетНДС 		= Истина;
					НовыйДокумент.УчитыватьНДС 			= Истина;
					НовыйДокумент.Склад 				    = Склад;
					
					// применим цену "Закупочная Москворечье " ко всему документу 
					СтруктураЗначений = Новый Структура();
					СтруктураЗначений.Вставить("ТекущийТипЦен"                 , Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка());
					СтруктураЗначений.Вставить("ТекущийВалютаДокумента"        , НовыйДокумент.ВалютаДокумента);
					СтруктураЗначений.Вставить("ТекущийВалютаВзаиморасчетов"   , НовыйДокумент.ВалютаДокумента);
					СтруктураЗначений.Вставить("ТекущийКурсДокумента"          , 1);
					СтруктураЗначений.Вставить("ТекущийКурсВзаиморасчетов"     , 1);
					СтруктураЗначений.Вставить("ТекущийУчитыватьНДС"           , Истина);
					СтруктураЗначений.Вставить("ТекущийСуммаВключаетНДС"       , Истина);
					СтруктураЗначений.Вставить("ПерезаполнитьЦеныПоТипу"       , Истина);
					СтруктураЗначений.Вставить("НовыйТипЦен"                   , Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("000000001"));
					СтруктураЗначений.Вставить("ПересчитатьЦеныПоВалюте"       , Ложь);
					СтруктураЗначений.Вставить("НовыйВалютаДокумента"          , НовыйДокумент.ВалютаДокумента);
					СтруктураЗначений.Вставить("НовыйКурсДокумента"            , 1);
					СтруктураЗначений.Вставить("НовыйКурсВзаиморасчетов"       , 1);
					СтруктураЗначений.Вставить("НовыйУчитыватьНДС"             , Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("000000001").ЦенаВключаетНДС);
					СтруктураЗначений.Вставить("НовыйСуммаВключаетНДС"         , Истина);
					
					СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
					СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(НовыйДокумент);
					ЗаполнениеДокументов.ИзменитьЦеныВалюту(НовыйДокумент, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, , "Товары", 
					Константы.ВалютаРегламентированногоУчета.Получить(), , СтруктураЗначений);
					
					Для Каждого СтрокаТЧ Из НовыйДокумент.Товары Цикл
						
						Если СтрокаТЧ.Цена = 0 Тогда
							
							СтрокаТЧ.Цена = 1 ;
							ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, НовыйДокумент);
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, НовыйДокумент);						
							
						КонецЕсли;					
						
					КонецЦикла;				
					
					Если ЭтоРегламент Тогда
						НовыйДокумент.Комментарий = "Регл. пополн. на основе матрицы";
						
						//+Кабанов А.В. 01.07.2025 # UT10-5320
						Если НЕ ПоставщикТОХ = Неопределено И ЗначениеЗаполнено(НовыйДокумент.ДоговорПоставщикаТОХ) Тогда 
							НовыйДокумент.Комментарий = СокрЛП(НовыйДокумент.Комментарий) + " " + СокрЛП(ПоставщикТОХ); 
						КонецЕсли;
						//+Кабанов А.В. 01.07.2025 # UT10-5320
						
					КонецЕсли;	
					
					//+Белов А. 21.07.2025 #UT10-5341
					Если НЕ ЭтоРазделениеПоТОХ Тогда
						//+Белов А. 21.07.2025 #UT10-5341
						
						Если ДокументыПровести  Тогда
							НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
						Иначе 
							НовыйДокумент.Записать();
						КонецЕсли; 
						
					Иначе					  
						
						Если МассивДляОбъединения <> Неопределено Тогда
							МассивДляОбъединения.Добавить(НовыйДокумент);	
						КонецЕсли;
						
					КонецЕсли;
					
					//+Кабанов А.В. 02.06.2025 # UT10-5262
					Если НЕ ПоставщикТОХ = Неопределено И НЕ ЭтоРегламент Тогда
						
						Если ПоставщикТОХ.РазделятьВыкупы И мНеОбъединятьВОбщемВыкупе Тогда 
							
							НовыйДокумент.Комментарий = СокрЛП(НовыйДокумент.Комментарий) + СокрЛП(ПоставщикТОХ);
							НовыйДокумент.Записать();
							НовыйДокумент.УстановитьПометкуУдаления(Истина);
							
						КонецЕсли;
						
					Иначе
						
						//+Белов А. 21.07.2025 #UT10-5341
						Если НЕ ЭтоРазделениеПоТОХ Тогда
							//+Белов А. 21.07.2025 #UT10-5341
							МассивНовыхДокументов.Добавить(НовыйДокумент); 
						КонецЕсли;
						
					КонецЕсли;
					//-Кабанов А.В. 02.06.2025 # UT10-5262  					  
					
					СтрокВДокументе = 0;
					
					Если ТекТовар <> КоличествоТоваровВВыборке Тогда 
						
						НовыйДокумент = Документы.ЗаказПоставщику.СоздатьДокумент();
						
						Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() И ЗаказНаГорючиеЖидкости Тогда
							НовыйДокумент.ГорючиеЖидкости = Истина;
						КонецЕсли;
						
						Если НЕ НовыйДокумент.ГорючиеЖидкости И НЕ СтрокаТаблСекций.Секция = "Def" Тогда
							НовыйДокумент.Секция = СтрокаТаблСекций.Секция; 					
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЕсли; 
	
КонецПроцедуры
  
Процедура РегламентноеВыполнение() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", Справочники.Пользователи.НайтиПоКоду("webadmin"));
	СтруктураНастройки.Вставить("ИмяОбъекта", "ОбработкаОбъект.ФормированиеЗаказаПоставщикуНаОсновеМатрицы");	
	СтруктураНастройки.Вставить("НаименованиеНастройки", "ФормированиеЗаказаПоставщикуНаОсновеМатрицыРегламентное");
	
	Если УниверсальныеМеханизмы.ПолучитьНастройку(СтруктураНастройки) Тогда
		
		ЭтотОбъект.мТекущаяНастройка = СтруктураНастройки;
		ВосстановитьНастройкиРегламентаИзСтруктуры(СтруктураНастройки.СохраненнаяНастройка);
		
		ИнициироватьПостроительДляОтбора(ПостроительОтчета);
		
		ВыполнитьЗапрос(Истина);
		
		МассивНовыхДокументов = Новый Массив;
		
		//+Белов А. 21.07.2025 #UT10-5341
		МассивОбъединения = Новый Массив;
		//-Белов А. 21.07.2025 #UT10-5341
		
		//+Кабанов А.В. 02.06.2025 # UT10-5262
		ПромТаблПостащиковТОХ = Товары.Выгрузить(,"ПоставщикТОХ");
		ПромТаблПостащиковТОХ.Свернуть("ПоставщикТОХ");
		
		Для Каждого СтрокаТаблПоставщиковТОХ Из ПромТаблПостащиковТОХ Цикл
			
			ПромПоставщикТОХ = СтрокаТаблПоставщиковТОХ.ПоставщикТОХ;
			//-Кабанов А.В. 02.06.2025 # UT10-5262
			
			Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() Тогда
				
				//+Белов А. 21.07.2025 #UT10-5341
				Если Не ПоОсновномуПоставщику Тогда
					
					Для Инд = 1 По 2 Цикл    		 
						
						СоздатьДокументыМодуль(Неопределено , МассивНовыхДокументов , Истина, Ложь , ПромПоставщикТОХ, ?(Инд = 1, Истина, Ложь), МассивОбъединения);
						СоздатьДокументыМодуль(Неопределено , МассивНовыхДокументов , Истина, Истина , ПромПоставщикТОХ, ?(Инд = 1, Истина, Ложь), МассивОбъединения);
						
					КонецЦикла;
					//-Белов А. 21.07.2025 #UT10-5341 
				Иначе 
					
					СоздатьДокументыМодуль(Неопределено , МассивНовыхДокументов , Истина, Ложь , ПромПоставщикТОХ);
					СоздатьДокументыМодуль(Неопределено , МассивНовыхДокументов , Истина, Истина , ПромПоставщикТОХ);
					
				КонецЕсли;
				
			Иначе	
				
				//+Белов А. 21.07.2025 #UT10-5341
				Если Не ПоОсновномуПоставщику Тогда
					
					Для Инд = 1 По 2 Цикл				
						СоздатьДокументыМодуль(Неопределено , МассивНовыхДокументов , Истина,  , ПромПоставщикТОХ, ?(Инд = 1, Истина, Ложь), МассивОбъединения);									
					КонецЦикла;
					
					//-Белов А. 21.07.2025 #UT10-5341
				Иначе
					СоздатьДокументыМодуль(Неопределено , МассивНовыхДокументов , Истина,  , ПромПоставщикТОХ);
				КонецЕсли;
				
				
			КонецЕсли; 
			
			Если НЕ МассивНовыхДокументов.Количество() = 0 Тогда
				
				Для Каждого СтрокаМассиваНовыхДокументов Из МассивНовыхДокументов Цикл
					
					Если СтрокаМассиваНовыхДокументов.Проведен Тогда
						РаботаСАвардой.ОтправитьЗаказВЦСВАварду(СтрокаМассиваНовыхДокументов.Ссылка);	
					КонецЕсли; 
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		//+Белов А. 21.07.2025 #UT10-5341
		Если МассивОбъединения.Количество() > 0 Тогда
			
			ОсновнойДокумент = Неопределено;
			
			ИндОсновного = -1;
			
			Для каждого Док Из МассивОбъединения Цикл
				
				ИндОсновного = ИндОсновного + 1;
				
				Если Док.ПометкаУдаления Тогда
					Продолжить;
				КонецЕсли; 
				
				ОсновнойДокумент = Док;  
				
				Прервать;
				
			КонецЦикла;  
			
			Если ОсновнойДокумент <> Неопределено Тогда
				
				МассивОбъединения.Удалить(ИндОсновного);
				
				Для каждого Док Из МассивОбъединения Цикл  
					
					Если Док.ПометкаУдаления Тогда
						Продолжить;
					КонецЕсли;
					
					Для каждого Стр Из Док.Товары Цикл
						
						НСтр = ОсновнойДокумент.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НСтр, Стр);
						
					КонецЦикла;
					
				КонецЦикла;		
				
			КонецЕсли;
			
			Если ДокументыПровести  Тогда
				ОсновнойДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Иначе 
				ОсновнойДокумент.Записать();
			КонецЕсли; 
			
			Если ОсновнойДокумент.Проведен Тогда
				РаботаСАвардой.ОтправитьЗаказВЦСВАварду(ОсновнойДокумент.Ссылка);	
			КонецЕсли;
			
		КонецЕсли;
		//-Белов А. 21.07.2025 #UT10-5341
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Обработка.Формироввание заказа поставщику на основе матрицы", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Не заполнены настройки для регламентного выполнения"); 
		
	КонецЕсли;
	
КонецПроцедуры
